Revit 2027 API
FabricationPart.IsATap Method
 Checks if it is any sort of tap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsATap()
Public Function IsATap As Boolean
public:
bool IsATap()
member IsATap : unit -> bool
Return Value
Boolean
 True if it is any sort of tap.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace